/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putchar.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: marvin <marvin@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/02 18:50:25 by marvin            #+#    #+#             */
/*   Updated: 2021/10/02 18:50:25 by marvin           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// Программа вывода одного числа через параметр.

#include <unistd.h>

void    ft_putchar(char c)
{
    write(1, &c, 1);
}

int main(int argc, char *argv[])
{
    if(argc == 2)
    {
        ft_putchar(*argv[1]);
        return (0);
    }
}
